{
  "https://www.tribevest.com/": {
    "title": "Tribevest - Administrative services and tools for small businesses",
    "description": "Entity formation, ownership structure management and distributions, and business operating account and transaction ledger management for partnerships.",
    "content": "Operate and run your partnership: LLC, business account, Operating Agreement, cap table management, distributions, taxes, and more.\nWe are upgrading your banking experience in collaboration with\nStripe and Evolve Bank & Trust!\nForm and fund an active member multi-member LLC. We provide assistance with entity formation, cap table and ownership structure management and distributions, and business operating account and transaction ledger management.\nWithout Tribevest, my journey would look completely different. Tribevest handles the heavy lifting, from forming LLCs correctly to providing an Operating Agreement template and enabling communications among Tribe members. I'm involved in 5 Tribes and group investing has been a game-changer to accelerate my wealth-building journey.\nI want to be more at home, have financial freedom, and not miss critical moments with my kids. I took the leap to invest in real estate and Tribevest came highly recommended within the community I'm a part of. I am in Tribes investing in short-term rentals, buy and holds, and multifamily. It's been a great tool, I believe all boats rise together.\nIt's easier than ever to send distributions to members of your partnership.\nWork with Tribevest's integrated tax partner for partnership tax preparation.\nFormalizing a partnership ensures peace of mind for everyone. Filing an LLC, creating an Operating Agreement, and setting formal procedures will ensure your relationships last a lifetime.",
    "status": "success"
  },
  "https://www.tribevest.com/how-it-works": {
    "title": "Access Failed",
    "description": "HTTP 404",
    "content": "Failed to access - Status code: 404",
    "status": "error"
  },
  "https://www.tribevest.com/features": {
    "title": "Access Failed",
    "description": "HTTP 404",
    "content": "Failed to access - Status code: 404",
    "status": "error"
  },
  "https://www.tribevest.com/pricing": {
    "title": "Access Failed",
    "description": "HTTP 404",
    "content": "Failed to access - Status code: 404",
    "status": "error"
  },
  "https://www.tribevest.com/about": {
    "title": "Tribevest | About",
    "description": "Tribevest is a collaborative platform that enables friends and family to easily assemble, formalize, fund, and manage an Investor Tribe",
    "content": "Meet the team behind Tribevest.\nWe're people who believe that everyone should be able to invest and build wealth with the people they trust.\nHow it all started\nTribevest CEO, Travis Smith, dreamed out loud about building generational wealth and forever altering our family’s financial trajectory. However, he’d never been introduced to ways of private investing, and wealth-building seemed out of reach. Travis and his brothers realized that they could overcome our lack of experience and know-how if we worked together.\nBut they had to confront the more obvious and immediate barrier — we lacked the capital required to break into wealth-building, freedom investments. By forming and funding an Investor Tribe, they unlocked a new future and the secrets of the wealthy.\nHow it’s going\nAfter 10 years in business we’re still going strong and growing each year. We’ve had a steady growth year over year and are very happy with the pace of the growth. We’re constantly adding new amazing people to our story and have quite a nice little community here.\nWhere we’re headed\nWe’re in this game to help people create and manage wealth through joint investments.\nJoin us on this mission\nWe’re looking for enthusiastic people that share our vision and enjoy helping others to join our team in the mission of bringing people with shared dreams together.",
    "status": "success"
  },
  "https://www.tribevest.com/investor-groups": {
    "title": "Tribevest - Partnerships",
    "description": "The only platform that sets your partnership up for success with streamlined entity formation, banking, and operating tools.",
    "content": "1. Add members\nEasily invite members to your Tribe with a unique link. Everyone in your Tribe will have access to the same collaborative dashboard.\n2. File or upload your Tribe's LLC\nFile your LLC in any of the 50 states and select additional compliance services if needed. Filing times are dependent on the state are a direct pass-thru cost.\n3. Configure rules & bylaws\nDecide how your group will operate when it comes to decisions such as management structure, equity, voting, when members join and leave, and more.\n4. Set up your cap table\nInput initial contributions or reserved equity of all members into the cap table.\n5. Ratify your Operating Agreement\nAll of the members who are part of your Tribe will be listed on a member-managed Operating Agreement we generate for you. Each member will be required to sign.\n6. Open your business account\nExperience the convenience of a full-service business account right at your fingertips, eliminating the need to visit a physical bank with your partners and endure weeks of waiting for account opening.",
    "status": "success"
  },
  "https://www.tribevest.com/business-account": {
    "title": "Tribevest - Business Account",
    "description": "Tribevest provides a full-service business account for your Tribe to pool capital for group investments.",
    "content": "✅ KYC check on all members\n✅ Send funds via ACH or Wire (fees may apply)\n✅ Order a business credit card\n✅ Remote check deposit capture\n✅ Same-day ACH\n✅ Automatically creates all members to be Payees with the ability for additional Payees\nOnce your LLC and EIN are completed, we open your business account.\nEveryone can see what is coming in and going out of the business account at all times.\nThere is no limit on the total amount an individual member can contribute. However, daily contribution limits may apply. Larger contributions can easily be split into more than one contribution if daily contribution limits are exceeded.\nYes, the tribe can use funding rounds to start pooling capital contributions. Each member's contributions will be held in their Wallet.\nAll members can track their contribution from the tribe dashboard. Once a business account is set up, the member can easily move their funds into the business account.\nFrom the Tribe dashboard you can send payments via Wire Transfer (fees may apply). After the Wire has been sent, you can see the status and details of your transfer like the IMAD and OMAD numbers associated.\nYou can link your bank account from your user dashboard. You'll be prompted by Plaid to locate your bank, provide login credentials and select the account you would like to link.\nYou can easily add a Payee in the Tribe dashboard under the Business Account tab.\nOnly designated admins can control the movement of money in the business account. All other members simply have visibility through the dashboard.",
    "status": "success"
  }
}